In [1]:
import numpy as np
import pandas as pd

In [ ]:
#Nan = Not a number-----its a synonim of 'isna'

In [2]:
pd.isnull(np.nan)

True

In [3]:
pd.isnull(None)

True

In [4]:
pd.isna(np.nan)

True

In [5]:
pd.isna(None)

True

In [6]:
#The opposite is

In [7]:
pd.notnull(None)

False

In [8]:
pd.notnull(np.nan)

False

In [10]:
pd.isnull(pd.Series([1,np.nan, 7]))

0    False
1     True
2    False
dtype: bool

In [11]:
pd.isnull(pd.DataFrame({
    'Column A': [1, np.nan, 2],
    'Column B': [np.nan, 2, 3],
    'Column C': [np.nan, 2, np.nan]
}))

   Column A  Column B  Column C
0     False      True      True
1      True     False     False
2     False     False      True

In [18]:
pd.isnull(pd.DataFrame({
    'Column A': [1, np.nan, 2],
    'Column B': [np.nan, 2, 3],
    'Column C': [np.nan, 2, np.nan]
}))

   Column A  Column B  Column C
0     False      True      True
1      True     False     False
2     False     False      True

In [19]:
s = pd.Series([1,2,3, np.nan, np.nan, 4])

In [25]:
s.info()

<class 'pandas.core.series.Series'>
RangeIndex: 6 entries, 0 to 5
Series name: None
Non-Null Count  Dtype
--------------  -----
4 non-null      float64
dtypes: float64(1)
memory usage: 180.0 bytes

In [17]:
pd.Series([1,2, np.nan]).count()

np.int64(2)

In [21]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

In [22]:
pd.notnull(s).count()

np.int64(6)

In [23]:
s[pd.notnull(s)]

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

In [24]:
s.isnull()

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [33]:
df = pd.DataFrame({
    'Column A': [1, np.nan, 30, np.nan],
    'Column B': [2 ,8, 31, np.nan],
    'Column C': [np.nan, 9,32, 100],
    'Column D': [5,8,34,110],
})

In [34]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Column A  2 non-null      float64
 1   Column B  3 non-null      float64
 2   Column C  3 non-null      float64
 3   Column D  4 non-null      int64
dtypes: float64(3), int64(1)
memory usage: 260.0 bytes

In [36]:
df.isnull() #is a number

   Column A  Column B  Column C  Column D
0     False     False      True     False
1      True     False     False     False
2     False     False     False     False
3      True      True     False     False

In [37]:
df.isnull().sum()

Column A    2
Column B    1
Column C    1
Column D    0
dtype: int64

In [41]:
df.dropna() #drops any row that has atleast a no value horzontally

   Column A  Column B  Column C  Column D
2      30.0      31.0      32.0        34

In [42]:
df.dropna(axis=1) # axis= columns

   Column D
0         5
1         8
2        34
3       110

In [43]:
df.dropna(thresh=3, axis='columns') #Choosing which columns to dropmand keep

   Column B  Column C  Column D
0       2.0       NaN         5
1       8.0       9.0         8
2      31.0      32.0        34
3       NaN     100.0       110

Filing nuls with a arbitrary value

In [44]:
s.fillna(0)

0    1.0
1    2.0
2    3.0
3    0.0
4    0.0
5    4.0
dtype: float64

In [45]:
s.fillna(s.mean())

0    1.0
1    2.0
2    3.0
3    2.5
4    2.5
5    4.0
dtype: float64

In [46]:
s.mean()

np.float64(2.5)

Filling the values with contigous (close) values

In [47]:
#The method argument is used to fill null with other values close to the null ones

In [53]:
s.fillna(method='ffill') #forward fill

C:\Users\Julio Lito\AppData\Local\Temp\ipykernel_2836\3693825361.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  s.fillna(method='ffill') #forward fill

0    1.0
1    2.0
2    3.0
3    3.0
4    3.0
5    4.0
dtype: float64

In [54]:
s.fillna(method='bfill') #backward fill

C:\Users\Julio Lito\AppData\Local\Temp\ipykernel_2836\3781871683.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  s.fillna(method='bfill') #backward fill

0    1.0
1    2.0
2    3.0
3    4.0
4    4.0
5    4.0
dtype: float64

In [55]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [56]:
df.fillna({
    'Column A': 0,
    'Column B': 99,
    'Column C': df['Column C'].mean()
    
})

   Column A  Column B  Column C  Column D
0       1.0       2.0      47.0         5
1       0.0       8.0       9.0         8
2      30.0      31.0      32.0        34
3       0.0      99.0     100.0       110

In [58]:
df.fillna(method='ffill', axis=0) #axis=0 ---vertical directions(columns)

C:\Users\Julio Lito\AppData\Local\Temp\ipykernel_2836\2979023529.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill', axis=0) #axis=0 ---vertical directions(columns)

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       1.0       8.0       9.0         8
2      30.0      31.0      32.0        34
3      30.0      31.0     100.0       110

In [59]:
df.fillna(method='ffill', axis=1) #axis=0 ---horizontal directions(rows)

C:\Users\Julio Lito\AppData\Local\Temp\ipykernel_2836\20667209.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill', axis=1) #axis=0 ---horizontal directions(rows)

   Column A  Column B  Column C  Column D
0       1.0       2.0       2.0       5.0
1       NaN       8.0       9.0       8.0
2      30.0      31.0      32.0      34.0
3       NaN       NaN     100.0     110.0

checking if there are NAs

In [61]:
#checking the length
#s.dropna() will have less values than s

In [62]:
s.dropna().count()

np.int64(4)

In [66]:
missing_value = len(s.dropna()) !=len(s)
missing_value

True

In [67]:
len(s)

6